app/controllers/photos_controller.rb

  def index
    @photos = Photo.all
---
SELECT "photos".* FROM "photos"

  def play
    if(params.has_key?(:difficulty))
    @difficulty = params[:difficulty]
    else
      @difficulty = 20
    end
    @allphotos = Photo.all
    @random = 1+rand(Photo.count)
    @pic1 = Photo.find_by(id: @random)
    if @pic1
    @photos = Photo.where(:tags => @pic1.tags)
---
SELECT "photos".* FROM "photos"
SELECT COUNT(*) FROM "photos"
SELECT  "photos".* FROM "photos"  WHERE "photos"."id" = 3 LIMIT 1
SELECT  "photos".* FROM "photos"  WHERE "photos"."tags" = 'screenshot' LIMIT 1

  def checkanswer
    @answer = params[:answer]
    @photoid = params[:photoid]
    user = User.find_by(id: current_user.id)
    @photo = Photo.find_by(id: @photoid)
     if @answer == @photo.tags
      user.update(score: user.score+3)
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = 1 LIMIT 1
SELECT  "photos".* FROM "photos"  WHERE "photos"."id" IS NULL LIMIT 1
UPDATE "users" SET "score" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["score", 6], ["updated_at", "2014-09-12 08:55:17.061984"]]

  def create
    @photo = Photo.new(photo_params)

    respond_to do |format|
      if @photo.save
---
INSERT INTO "photos" ("created_at", "picture", "tags", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-09-12 06:36:55.136410"], ["picture", "10442388_565769876886069_7448371019722939079_n.jpg"], ["tags", "bob marley"], ["updated_at", "2014-09-12 06:36:55.136410"]]

  def destroy
    @photo.destroy
---
DELETE FROM "photos" WHERE "photos"."id" = ?  [["id", 15]]

    def set_photo
      @photo = Photo.find(params[:id])
---
SELECT  "photos".* FROM "photos"  WHERE "photos"."id" = ? LIMIT 1  [["id", 15]]