app/controllers/users_controller.rb

  def index
    @users = User.order( 'score DESC' ).paginate(page: params[:page])
---
SELECT  "users".* FROM "users"   ORDER BY score DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "users"

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("created_at", "email", "name", "password_digest", "remember_token", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    if @user.update_attributes(user_params)
---
UPDATE "users" SET "email" = ?, "name" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["email", "mrinal.dhar@me.com"], ["name", "MrinalDhar"], ["password_digest", "$2a$10$WOaXMjTMsKijbgqImcpzseL/tPAC23I6EEjFqCBuCsL60s1UXV1Bm"], ["updated_at", "2014-09-12 06:40:02.033175"]]

  def invite
    @email = params[:email]
    @current_user = User.find(params[:id])
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 108]]